#!/usr/bin/env ruby
# -*- coding: utf-8 -*-
# generate wasuramoti://fudaset/... URL which can be ACTION_VIEW'ed by wasuramoti
# URL spec:
#   URL := wasuramoti://fudaset/<BASE64_ENCODED_JSON>
#   BASE64_ENCODED_JSON := Base64.urlsafe_encode64(<STRUCTURE>.to_json)
#   STRUCTURE := {FUDASET_TITLE:[{<FUDASET_NAME_1>:<FUDASET_SET_AS_BIGINT_1>},{<FUDASET_NAME_2>:<FUDASET_SET_AS_BIGINT_2>}, ... ]}
#   FUDASET_TITLE: Title of sets of FudaSet in UTF-8
#   FUDASET_NAME_* := Name of each FudaSet in UTF-8
#   FUDASET_SET_AS_BIGINT_* := (If fudanum of fudaset is [n1,n2,n3,...]  then (1<<(n1-1)) + (1<<(n2-1)) + ...).to_s(36)

require "json"
require "base64"

fudasets = [
  {"三分の百首" => [
    {"三分の百首: A" => [43,3,52,1,79,7,12,39,30,58,78,45,69,56,31,64,36,80,84,53,86,25,88,19,61,21,63,65,74,40,37,18,70,77]},
    {"三分の百首: B" => [41,97,24,10,29,68,73,55,4,16,89,34,90,14,94,49,27,17,75,42,91,50,15,13,23,100,66,87,57,51,6,98,48]},
    {"三分の百首: C" => [5,26,72,82,60,95,44,20,8,92,38,54,76,11,9,2,67,47,59,32,28,85,62,93,83,33,35,99,71,46,22,81,96]}
  ]},
  {"きまり字五色二十人一首" => [
    {"きまり字五色: A" => [87,18,57,77,65,74,13,23,40,37,66,100,46,71,17,42,75,33,35,99]},
    {"きまり字五色: B" => [61,21,63,4,89,34,55,16,73,14,90,94,49,27,41,97,24,29,68,10]},
    {"きまり字五色: C" => [22,70,81,91,15,50,5,26,72,82,95,60,44,20,38,54,8,92,11,76]},
    {"きまり字五色: D" => [36,80,84,53,86,25,88,19,51,6,98,48,47,59,28,32,62,85,83,93]},
    {"きまり字五色: E" => [43,3,52,1,79,7,12,39,30,58,78,45,69,56,31,64,2,67,9,96]}
  ]},
  {"五色百人一首" => [
    {"五色かるた: 青" => [3,5,6,12,14,24,30,31,50,57,61,62,69,70,74,75,76,82,91,100]},
    {"五色かるた: 桃" => [1,4,13,16,22,28,34,40,48,51,58,65,66,72,73,80,83,84,86,97]},
    {"五色かるた: 黄" => [2,7,10,18,32,33,37,39,46,47,55,60,78,79,81,85,87,89,94,96]},
    {"五色かるた: 緑" => [8,9,11,15,17,20,23,26,29,35,36,38,41,42,54,59,68,71,92,93]},
    {"五色かるた: 橙" => [19,21,25,27,43,44,45,49,52,53,56,63,64,67,77,88,90,95,98,99]}
  ]},
  {"歌番号順に10首ごと" => [
    {"歌番号: 1-10" => 1..10 },
    {"歌番号: 11-20" => 11..20 },
    {"歌番号: 21-30" => 21..30 },
    {"歌番号: 31-40" => 31..40 },
    {"歌番号: 41-50" => 41..50 },
    {"歌番号: 51-60" => 51..60 },
    {"歌番号: 61-70" => 61..70 },
    {"歌番号: 71-80" => 71..80 },
    {"歌番号: 81-90" => 81..90 },
    {"歌番号: 91-100" => 91..100 }
  ]}
]

fudasets.each{|sets|
  data = sets.map{|title,set|
    Hash[title,
       set.map{|kv|
       Hash[kv.map{|n,s|
         [n,s.inject(0){|x,c|x+(1<<(c-1))}.to_s(36)]
       }]
     }]
   }[0]
  title = data.keys[0]
  url = "wasuramoti://fudaset/#{Base64.urlsafe_encode64(data.to_json)}"
  puts "<a href='#{url}'>#{title}</a>"
}
